app/views/users/index.html.erb

SELECT  `messages`.* FROM `messages` WHERE `messages`.`conversation_id` = 1  ORDER BY `messages`.`id` DESC LIMIT 1
---
                        <h4 class="media-heading"><%= conversation_interlocutor(conversation).email %></h4>
                        <p><%= conversation.messages.last.nil? ? "No messages" : truncate(conversation.messages.last.body, length: 45) %></p>